Revit 2024 API
IndependentTag.SetLeaderElbow Method
 Set the position of the elbow of the tag's leader that points to specified reference. If this tag is a multileader tag and the elbows are merged, the input position will be set to all leaders.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public void SetLeaderElbow(
	Reference referenceTagged,
	XYZ elbowPosition
)
Visual Basic
Public Sub SetLeaderElbow ( _
	referenceTagged As Reference, _
	elbowPosition As XYZ _
)
Visual C++
public:
void SetLeaderElbow(
	Reference^ referenceTagged,
	XYZ^ elbowPosition
)
Parameters
referenceTagged
Type: Autodesk.Revit.DB.Reference
 The reference which is tagged.
elbowPosition
Type: Autodesk.Revit.DB.XYZ
 The position of the elbow.
Remarks
 Straight leaders do not have elbow points.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The specified reference is not currently tagged. -or- The leader for the tagged reference isn't visible.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The IndependentTag object does not have a tag behavior.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace